{
  "name": "Nishant Tanwar",
  "title": "Sr. Full-Stack Engineer",
  "summary": "Senior {Backend} Engineer with over 10 years of professional experience, including 7 years of remote work, I am a seasoned Software Engineer proficient in a range of technologies, including Kubernetes, Google Cloud Platform, AWS, Microservices, Android, Kotlin,\nJava, and Jetpack Compose. Throughout the years, I have contributed to diverse domains such as Supply Chain, Service Marketplaces, and Financial Services. I am passionate about creating impactful solutions that drive meaningful change",

  "skills": {
    "programming_languages": ["Kotlin", "Java", "Python", "Node.js"],
    "technologies/frameworks": ["Kubernetes", "Docker", "Spring Boot", "Google Cloud Platform (GCP)", "Amazon Web Services(AWS)", "Microservices", "Kotlin Multiplatform", "Nginx", "Junit", "MySQL", "PostgreSQL", "DynamoDB", "Android", "CI/CD"
]
  },
  "experience": [
    {
      "role": "Sr. Software Engineer",
      "company": "Tala",
      "duration": "2020–2024",
      "responsibilities": [
        "Led the development of the Tala financial system, fostering cross-functional collaboration, resulting in over 20 million users",
        "Integrated a Server-Driven UI framework using Golang and GraphQL, enhancing user interaction by 20%.",
        "Developed an internal caching service using Golang, reducing request latency by 35% and significantly improving performance and reliability.",
        "Implemented cross-platform multi-country module to deploy applications into multiple countries (Philippines, India, Mexico, and Kenya).",
        "Led the development of an in-house wallet with server-side API integration, resulting in a 50% increase in transaction processing speed and a 20% reduction in integration errors."
      ]
    }
  ],
  "education": {
    "degree": "Bachelor of Technology in Computer Science",
    "institution": "Guru Gobind Singh Indraprastha University (GGSIPU)",
    "year": "2009–2013"
  }
}
